do
 function run(msg, matches)
return [[
<code>راهنمای دستورات ربات</code>

 قفل | کانتک-لینک-فلود-اسپم-عربی-ممبر-ارتی ال-استیکر-تگ-یوزرنیم-ربات-انگلیسی-فوروارد-اینلاین-عدد-دستور
<code>بستن امکانات بالا</code>
➖➖➖➖➖➖
 بازکردن | کانتک-لینک-فلود-اسپم-عربی-ممبر-ارتی ال-استیکر-تگ-یوزرنیم-ربات-انگلیسی-فوروارد-اینلاین-عدد-دستور
<code>بازکردن امکانات بالا</code>
➖➖➖➖➖➖
 موت | گیف-ویس-عکس-فیلم-تکست-فایل-همه
<code>موت کردن امکانات بالا</code>
➖➖➖➖➖➖
 آنموت | گیف-ویس-عکس-فیلم-تکست-فایل-همه
<code>آنموت کردن امکانات بالا</code>
➖➖➖➖➖➖
 کمک مدیر @username 
<code>کمک مدیر کردن یک شخص</code>
➖➖➖➖➖➖
 حذف کمک مدیر @username
<code>خارج کردن شخص ازکمک مدیریت</code>
➖➖➖➖➖➖
 لیست مدیران
<code>نمایش کمک مدیران</code>
➖➖➖➖➖➖
 ban @username 
<code>اخراج کردن یک فرد از گروه به صورت دائمی</code>
➖➖➖➖➖➖
 unban @username
<code>خارج کردن یک فرد از حالت اخراج دائمی</code>
➖➖➖➖➖➖
 اطلاعات
<code>نمایش اطلاعات اصلی گروه</code>
➖➖➖➖➖➖
 پاک کن [reply|number]
<code>پاک کردن تعداد پیام های مورد نظر با ریپلی و تعداد</code>
➖➖➖➖➖➖
 ادمین ها
<code>نمایش لیست ادمین های گروه</code>
➖➖➖➖➖➖
 filter [word]
<code>فیلتر کردن یک کلمه</code>
➖➖➖➖➖➖
 unfilter [word]
<code>در اوردن کلمه از فیلتر</code>
➖➖➖➖➖➖
 filterlist
<code>نشان دادن کلمه های فیلتر شده.</code>
➖➖➖➖➖➖
 صاحب گروه
<code>نمایش آیدی خریدار گروه</code>
➖➖➖➖➖➖
 حذف کن [reply|id]
<code>بلاک کردن و کیک کردن فرد از گروه.</code>
➖➖➖➖➖➖
 setwlc[متن]
<code>تنظیم یک متن به عنوان متن خوشامد گویی</code>
➖➖➖➖➖➖
 delwlc
<code>حذف پیام خوشامد گویی</code>
➖➖➖➖➖➖
 ایدی
<code>نمایش اطلاعات اکانت شما .</code>
➖➖➖➖➖➖
 تنظیم نام [متن]
<code>تغییر اسم گروه</code>
➖➖➖➖➖➖
 تنظیم عکس
<code>جایگزین کردن عکس گروه</code>
➖➖➖➖➖➖
 قوانین [متن]
<code>گذاشتن قوانین برای گروه</code>
➖➖➖➖➖➖
 درباره گروه [متن]
<code>گذاشتن متن توضیحات برای سوپر گروه(این متن در بخش توضیحات گروه هم نمایش داده میشه)</code>
➖➖➖➖➖➖
 لینک جدید
<code>ساختن لینک جدید</code>
➖➖➖➖➖➖
 لینک
<code>گرفتن لینک</code>
➖➖➖➖➖➖
 ست لینک
<code>ست کردن لینک</code>
➖➖➖➖➖➖
 قوانین
<code>نمایش قوانین</code>
➖➖➖➖➖➖
 فلود [تعداد]
<code>گذاشتن value به عنوان حساسیت اسپم</code>
➖➖➖➖➖➖
 تنظیمات
<code>نمایش تنظیمات گروه</code>
➖➖➖➖➖➖
 لیست موت
<code>نمایش لیست افراد سایلنت شده</code>
➖➖➖➖➖➖
 پاک کردن [قانون|درباره|لیست مدیران|لیست موت|ربات]
<code>پاک کردن لیست ناظم ها-درباره-لیست سایلنت شده ها-قوانین-بات ها</code>
➖➖➖➖➖➖
]]
end
return {
patterns = {
"^[!/#]راهنما$",
"^راهنما$",
"^کمک$"
},
run = run
}
end